package lesson31;

public class Demo {
    public static void main(String[] args) {
        System.out.println(Solution.countSymbols("О!!!@@@@й не факт, что таблица будет лучше, учитывая тот момент, что сравнение (это все же сравнение регистра и константы), а обращение к таблице, это дополнительное обращение к памяти. Конечно в данном случае все зависит от реализации виртуальной машины, но все же использование константы и обращение к памяти. При сравнении есть усугубление в виде последующего условного перехода, так что данный вариант стоило бы просто проверить на практике."));
        System.out.println(Solution.words("О!!!@@@@й не факт, что таблица будет лучше, учитывая тот момент, что сравнение (это все же сравнение регистра и константы), а обращение к таблице, это дополнительное обращение к памяти. Конечно в данном случае все зависит от реализации виртуальной машины, но все же использование константы и обращение к памяти. При сравнении есть усугубление в виде последующего условного перехода, так что данный вариант стоило бы просто проверить на практике."));
    }
}
